{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"input_dtype": "float32", "init": "glorot_uniform", "return_sequences": false, "W_regularizer": null, "dropout_U": 0.0, "name": "lstm_1", "go_backwards": false, "b_regularizer": null, "unroll": false, "stateful": false, "activation": "tanh", "trainable": true, "output_dim": 32, "consume_less": "cpu", "input_dim": 4, "inner_init": "orthogonal", "batch_input_shape": [null, 1, 4], "dropout_W": 0.0, "input_length": 1, "forget_bias_init": "one", "U_regularizer": null, "inner_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"output_dim": 4, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear"}}]}